small_hearth/results_small_hearth_250123_101548/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Properties from https://www.jstage.jst.go.jp/article/tetsutohagane/100/8/100_925/_pdf

phases
(
     iron
     {
         transportModel Newtonian;
         nu nu   [ 0  2 -1  0 0 0 0 ] 1e-06;  
         rho rho [ 1 -3  0  0 0 0 0 ] 6700; 
	 Cp  Cp  [ 0  2 -2 -1 0 0 0 ] 850; 
    
	 kf  kf  [ 1  1 -3 -1 0 0 0 ] 330; // Here is the thermal conductivity, sped up! 16.5*20; 
	 D   D   [ 0  2 -1  0 0 0 0 ] 0.17e-6; // Here is the mass diffusion coefficient, sped up! 0.85e-8*20;
         // kf and D serve similarly in the calculation of heat/mass transfer coefficient

	 Cs  Cs  [ 1 -3  0  0 0 0 0 ] 335;  //Here the unit is in kg/m3, but it is weight% in paper as 5 m%
     }
     
     air
     {
         transportModel Newtonian;
         nu  nu  [ 0 2  -1  0 0 0 0 ] 3e-04;
         rho rho [ 1 -3  0  0 0 0 0 ] 0.25; 
	 Cp  Cp  [ 0  2 -2 -1 0 0 0 ] 1200;
	 kf  kf  [ 1  1 -3 -1 0 0 0 ] 2.0; // sped up! 0.1*20;
	 D   D   [ 0  2 -1  0 0 0 0 ] 0.17e-6; // sped up! 0.85e-8*20; // dummy
	 Cs  Cs  [ 1 -3  0  0 0 0 0 ] 0.00025;
     }
);

sigmas
(
      (iron air) 1.65  // N/m
);


// ************************************************************************* //
