small_hearth/results_small_hearth_250123_101548/CFD/0/org.0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0; // see setFieldsDict

boundaryField
{
  atmosphere
    {
        type            zeroGradient;
    }
  walls
    {
        type            zeroGradient;
    }
  outlet
    {
        type            zeroGradient;
    }
  inlet
    {
	type		fixedValue;
	value 		uniform 135; // Here is the inlet concentration which is 2 m%
    }
}


// ************************************************************************* //
