small_hearth/results_small_hearth_250123_101548/CFD/0/org.0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1623.15;

boundaryField
{
  atmosphere
    {
        type            zeroGradient;
    }
  walls
    {
        type            zeroGradient;
    }
  outlet
    {
        type            zeroGradient;
    }
  inlet
    {
	type		fixedValue;
	value 		uniform 1823.15;
    }
}


// ************************************************************************* //
