small_hearth/results_small_hearth_250123_101548/CFD/0/org.0/pSmooth
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pSmoothField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0]; //Pa

internalField   uniform 0;

boundaryField
{

    walls
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue; 
	value		uniform 0;
    }

    atmosphere
    {
        type            fixedValue; 
	value		uniform 140000;
    }

    inlet
    {
	type		zeroGradient;
    }
}

// ************************************************************************* //
