small_hearth/results_small_hearth_250123_101548/CFD/0/org.0/wallTemp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallTemp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
  atmosphere
    {
        type            zeroGradient;
    }
  walls
    {
        type            fixedValue;
	value           uniform 1473.15; 
    }
  outlet
    {
        type            zeroGradient;
    }
  inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
