small_hearth/results_small_hearth_250123_101548/CFD/system/decomposeParDict
/*-------------------------------*- C++ -*---------------------------------*\
|    =========                                                              |
|    \\      /     OpenFOAM                                                 |
|     \\    /                                                               |
|      \\  /       The Open Source CFD Toolbox                              |
|       \\/                                        http://www.OpenFOAM.org  |
\*-------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  8;


//method          scotch;
method          simple;


simpleCoeffs
{
    n           (2 2 2);
    delta       0.001;
}



// ************************************************************************* //
