small_hearth/results_small_hearth_250123_101548/CFD/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.iron 0
    volScalarFieldValue C 0
);

regions
(
    cylinderToCell
	{
		p1 (0 0 0);		//center point, min
		p2 (0 0 0.4);		//center point, max
		radius 0.5;
		fieldValues
		(
			volScalarFieldValue alpha.iron 1
			volScalarFieldValue alpha.air 0
			volScalarFieldValue C 235   // Here is the initial concentration 3.5 m%
		);		
	}
);


// ************************************************************************* //
